fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// {{Борисова А.В.
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	
	
	// Акт об оказанных услугах
	КомандаПечати = КомандыПечати.Добавить(); 
    КомандаПечати.Идентификатор = "Акт";
    КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
    КомандаПечати.Порядок = 5;         
    
КонецПроцедуры  
    
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"Акт");
        Если ПечатнаяФорма <> Неопределено Тогда
            ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати); 
            ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
            ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ВКМ_Акт";
        КонецЕсли;
КонецПроцедуры       
//Борисова А.В.}}

#КонецОбласти 
 
// {{Борисова А.В.
#Область СлужебныеПроцедурыИФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";
        
    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_Акт"); 
        
    ДанныеДокументов = ПолучитьДанныеДокументов (МассивОбъектов);   
       
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	ПервыйДокумент = Ложь;
		
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
	ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет);
	ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет);	
	ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		
    // В табличном документе необходимо задать имя области, в которую был 
   	// выведен объект. Нужно для возможности печати комплектов документов.
    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
	КонецЦикла;  
        
	Возврат ТабличныйДокумент;
    
КонецФункции    
    
Функция ПолучитьДанныеДокументов (МассивОбъектов)
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   РеализацияТоваровУслуг.Ссылка КАК Ссылка,
        |   РеализацияТоваровУслуг.Номер КАК Номер,
        |   РеализацияТоваровУслуг.Дата КАК Дата,
        |   РеализацияТоваровУслуг.Организация КАК Организация,
        |   РеализацияТоваровУслуг.Контрагент КАК Контрагент,
        |   РеализацияТоваровУслуг.Договор КАК Договор,
        |   РеализацияТоваровУслуг.Ответственный КАК Ответственный,
        |   РеализацияТоваровУслуг.Услуги.(
        |       Ссылка КАК Ссылка,
        |       НомерСтроки КАК НомерСтроки,
        |       Номенклатура КАК Номенклатура,
        |       Количество КАК Количество,
        |       Цена КАК Цена,
        |       Сумма КАК Сумма
        |   ) КАК Услуги
        |ИЗ
        |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |   РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
        
        Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Возврат ВыборкаДетальныеЗаписи; 
        
КонецФункции
    
Процедура ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет)
        
        ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик"); 
        ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель"); 
        
        ДанныеПечати = Новый Структура; 
        ДанныеПечати.Вставить("ПредставлениеПоставщика", ДанныеДокументов.Организация); 
        ДанныеПечати.Вставить("ПредставлениеПокупателя", ДанныеДокументов.Контрагент); 
        ДанныеПечати.Вставить("Основание", ДанныеДокументов.Договор); 
        
        ОбластьПоставщик.Параметры.Заполнить(ДанныеПечати); 
        ТабличныйДокумент.Вывести(ОбластьПоставщик); 
        
        ОбластьПокупатель.Параметры.Заполнить(ДанныеПечати); 
        ТабличныйДокумент.Вывести(ОбластьПокупатель); 

КонецПроцедуры
    
Процедура ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
        
        ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
        
        ДанныеПечати = Новый Структура;
        
        ШаблонЗаголовка = "Акт об оказанных услугах %1 от %2";
        ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
        ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
        Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
        ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
        
        ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
        ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
        
КонецПроцедуры
    
Процедура ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет)
        
        ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
        ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
        ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
        ОбластьИтого = Макет.ПолучитьОбласть("Итого"); 
        ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
        
        ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
        
        СуммаУслугИтого = 0;//? 
        
        ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
        Пока ВыборкаУслуги.Следующий() Цикл
            ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
            ТабличныйДокумент.Вывести(ОбластьСтрока);
            СуммаУслугИтого = СуммаУслугИтого + ВыборкаУслуги.Сумма;
        КонецЦикла;
        
        СуммаПрописью = ЧислоПрописью(СуммаУслугИтого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
        
        ТабличныйДокумент.Вывести(ОбластьПодвал);
        
        ДанныеПечати = Новый Структура;
        ДанныеПечати.Вставить("Всего", СуммаУслугИтого);
        ДанныеПечати.Вставить("СуммаПрописью", СуммаПрописью);
        
        ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
        ТабличныйДокумент.Вывести(ОбластьИтого); 
        
        ОбластьСуммаПрописью.Параметры.Заполнить(ДанныеПечати);
        ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
        
КонецПроцедуры
    
Процедура ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвалАкта = Макет.ПолучитьОбласть("ПодвалАкта"); 
        
    ТабличныйДокумент.Вывести(ОбластьПодвалАкта); 
        
КонецПроцедуры
  
 #КонецОбласти   
//Борисова А.В.}}

#КонецЕсли
